[
    {
        "variety": "Polypodiaceae",
        "description": "A family of ferns known for their leathery fronds and widespread distribution in tropical and subtropical regions.",
        "ferns": [
            {
                "name": "Polypodium vulgare",
                "common_name": "Common Polypody",
                "description": "A hardy fern with leathery, evergreen fronds that thrive in rocky and shaded areas."
            },
            {
                "name": "Polypodium glycyrrhiza",
                "common_name": "Licorice Fern",
                "description": "Known for its sweet-tasting roots, this fern grows on moist, shaded rocks and tree trunks."
            },
            {
                "name": "Pleopeltis polypodioides",
                "common_name": "Resurrection Fern",
                "description": "A remarkable fern that can survive drought by drying up and reviving when moisture returns."
            },
            {
                "name": "Polypodium hesperium",
                "common_name": "Western Polypody",
                "description": "A small fern found in the western United States, typically in rocky habitats."
            },
            {
                "name": "Polypodium scouleri",
                "common_name": "Leatherleaf Fern",
                "description": "This fern has thick, leathery fronds and is commonly found along the Pacific coast."
            }
        ]
    },
    {
        "variety": "Dryopteridaceae",
        "description": "A large family of ferns with robust and often leathery fronds, commonly found in woodlands.",
        "ferns": [
            {
                "name": "Dryopteris filix-mas",
                "common_name": "Male Fern",
                "description": "A sturdy fern with pinnate fronds, commonly found in temperate forests."
            },
            {
                "name": "Dryopteris marginalis",
                "common_name": "Marginal Wood Fern",
                "description": "Known for its evergreen fronds, this fern thrives in rocky, shaded environments."
            },
            {
                "name": "Dryopteris erythrosora",
                "common_name": "Autumn Fern",
                "description": "This fern features striking copper-red fronds that mature to green."
            },
            {
                "name": "Dryopteris cristata",
                "common_name": "Crested Wood Fern",
                "description": "A fern with uniquely crested fronds, typically found in wetland areas."
            },
            {
                "name": "Dryopteris affinis",
                "common_name": "Golden Male Fern",
                "description": "A robust fern with yellowish fronds and a preference for moist, shaded habitats."
            }
        ]
    },
    {
        "variety": "Pteridaceae",
        "description": "A family of ferns known for their delicate, often finely divided fronds, common in arid and tropical regions.",
        "ferns": [
            {
                "name": "Adiantum capillus-veneris",
                "common_name": "Maidenhair Fern",
                "description": "A delicate fern with fan-shaped fronds and black stems, commonly found in humid environments."
            },
            {
                "name": "Pteris cretica",
                "common_name": "Cretan Brake",
                "description": "A fern with upright fronds, often variegated with white, found in warm, sheltered spots."
            },
            {
                "name": "Cheilanthes lanosa",
                "common_name": "Hairy Lip Fern",
                "description": "This fern has fuzzy fronds and is adapted to dry, rocky habitats."
            },
            {
                "name": "Pellaea rotundifolia",
                "common_name": "Button Fern",
                "description": "A compact fern with round leaflets, ideal for growing in pots or shaded gardens."
            },
            {
                "name": "Adiantum pedatum",
                "common_name": "Northern Maidenhair Fern",
                "description": "A graceful fern with horizontally spreading fronds, often found in moist, shaded woodlands."
            }
        ]
    },
    {
        "variety": "Aspleniaceae",
        "description": "A family of ferns distinguished by their elongated sori and often linear fronds, found in various habitats worldwide.",
        "ferns": [
            {
                "name": "Asplenium nidus",
                "common_name": "Bird's Nest Fern",
                "description": "A tropical fern with large, spoon-shaped fronds, often grown as a houseplant."
            },
            {
                "name": "Asplenium scolopendrium",
                "common_name": "Hart's Tongue Fern",
                "description": "A fern with undivided, strap-like fronds that thrive in shaded, limestone-rich areas."
            },
            {
                "name": "Asplenium trichomanes",
                "common_name": "Maidenhair Spleenwort",
                "description": "A small fern with dark, wiry stems and pinnate fronds, typically found on rocks."
            },
            {
                "name": "Asplenium bulbiferum",
                "common_name": "Mother Spleenwort",
                "description": "A fern known for producing tiny plantlets on its fronds, often found in moist environments."
            },
            {
                "name": "Asplenium ruta-muraria",
                "common_name": "Wall-rue",
                "description": "A hardy fern that grows on limestone rocks and walls, with small, divided fronds."
            }
        ]
    },
    {
        "variety": "Blechnaceae",
        "description": "A family of ferns characterized by their leathery, often pinnate fronds, commonly found in tropical and subtropical regions.",
        "ferns": [
            {
                "name": "Blechnum spicant",
                "common_name": "Hard Fern",
                "description": "A fern with stiff, erect fronds, often found in acidic soils in woodlands."
            },
            {
                "name": "Blechnum chilense",
                "common_name": "Chilean Hard Fern",
                "description": "A robust fern with arching, leathery fronds, commonly used in ornamental gardening."
            },
            {
                "name": "Blechnum occidentale",
                "common_name": "Sinker Fern",
                "description": "A fern with spreading fronds that prefers wet, marshy environments."
            },
            {
                "name": "Blechnum penna-marina",
                "common_name": "Alpine Water Fern",
                "description": "A small, hardy fern with creeping rhizomes, often found in alpine regions."
            },
            {
                "name": "Blechnum tabulare",
                "common_name": "Mountain Blechnum",
                "description": "A fern with large, pinnate fronds, typically found in mountainous areas."
            }
        ]
    },
    {
        "variety": "Thelypteridaceae",
        "description": "A family of ferns known for their often pinnate and finely divided fronds, common in temperate and tropical regions.",
        "ferns": [
            {
                "name": "Thelypteris palustris",
                "common_name": "Marsh Fern",
                "description": "A fern that thrives in wetlands, with finely divided, pinnate fronds."
            },
            {
                "name": "Phegopteris hexagonoptera",
                "common_name": "Broad Beech Fern",
                "description": "A fern with broad, triangular fronds, typically found in moist, shaded forests."
            },
            {
                "name": "Thelypteris noveboracensis",
                "common_name": "New York Fern",
                "description": "A fern with delicate, tapering fronds, common in eastern North American woodlands."
            },
            {
                "name": "Thelypteris kunthii",
                "common_name": "Southern Shield Fern",
                "description": "A robust fern with large, pinnate fronds, often found in southern U.S. woodlands."
            },
            {
                "name": "Thelypteris decursive-pinnata",
                "common_name": "Japanese Beech Fern",
                "description": "A fern with finely divided, feathery fronds, commonly found in Japan and East Asia."
            }
        ]
    },
    {
        "variety": "Osmundaceae",
        "description": "A family of large, often woody ferns known for their bipinnate fronds and preference for wet habitats.",
        "ferns": [
            {
                "name": "Osmunda regalis",
                "common_name": "Royal Fern",
                "description": "A tall, elegant fern with bipinnate fronds, often found in wetlands and along streams."
            },
            {
                "name": "Osmundastrum cinnamomeum",
                "common_name": "Cinnamon Fern",
                "description": "A fern with large, cinnamon-colored fertile fronds and bright green sterile fronds."
            },
            {
                "name": "Osmunda claytoniana",
                "common_name": "Interrupted Fern",
                "description": "A fern with large fronds that are 'interrupted' by fertile sporangia in the middle."
            },
            {
                "name": "Osmunda japonica",
                "common_name": "Japanese Royal Fern",
                "description": "A fern with finely divided, bipinnate fronds, common in Japan and East Asia."
            },
            {
                "name": "Osmunda spectabilis",
                "common_name": "American Royal Fern",
                "description": "Similar to the Royal Fern, this species is native to North America and prefers wet habitats."
            }
        ]
    },
    {
        "variety": "Davalliaceae",
        "description": "A family of ferns known for their creeping rhizomes and delicate, often hairy fronds, commonly found in tropical regions.",
        "ferns": [
            {
                "name": "Davallia canariensis",
                "common_name": "Canary Island Fern",
                "description": "A fern with delicate, feathery fronds and creeping rhizomes, often grown as an ornamental plant."
            },
            {
                "name": "Davallia fejeensis",
                "common_name": "Rabbit's Foot Fern",
                "description": "Known for its furry rhizomes resembling rabbit feet, this fern is popular as a houseplant."
            },
            {
                "name": "Davallia mariesii",
                "common_name": "Maries' Fern",
                "description": "A small fern with finely divided fronds and creeping rhizomes, often found in rocky areas."
            },
            {
                "name": "Davallia trichomanoides",
                "common_name": "Hare's Foot Fern",
                "description": "A fern with delicate, lace-like fronds and hairy rhizomes, commonly grown in hanging baskets."
            },
            {
                "name": "Davallia solida",
                "common_name": "Squirrel's Foot Fern",
                "description": "This fern has thick, furry rhizomes and leathery fronds, often found in tropical forests."
            }
        ]
    },
    {
        "variety": "Cyatheaceae",
        "description": "A family of tree ferns known for their tall, trunk-like stems and large, spreading fronds, primarily found in tropical and subtropical regions.",
        "ferns": [
            {
                "name": "Cyathea cooperi",
                "common_name": "Australian Tree Fern",
                "description": "A fast-growing tree fern with large, arching fronds, commonly found in tropical gardens."
            },
            {
                "name": "Cyathea medullaris",
                "common_name": "Black Tree Fern",
                "description": "A tall tree fern with dark, rough trunks and large, feathery fronds, native to New Zealand."
            },
            {
                "name": "Cyathea dealbata",
                "common_name": "Silver Fern",
                "description": "A fern with silvery undersides on its fronds, an iconic symbol of New Zealand."
            },
            {
                "name": "Cyathea spinulosa",
                "common_name": "Spiny Tree Fern",
                "description": "A tree fern with spiny stems and large, leathery fronds, typically found in Asian forests."
            },
            {
                "name": "Cyathea smithii",
                "common_name": "Soft Tree Fern",
                "description": "A delicate tree fern with soft, finely divided fronds, often found in moist, shaded areas."
            }
        ]
    },
    {
        "variety": "Gleicheniaceae",
        "description": "A family of ferns with highly divided, often lacy fronds, typically found in tropical and subtropical regions.",
        "ferns": [
            {
                "name": "Dicranopteris linearis",
                "common_name": "Old World Forked Fern",
                "description": "A fern with forked, sprawling fronds, commonly found in open, disturbed habitats."
            },
            {
                "name": "Gleichenia microphylla",
                "common_name": "Coral Fern",
                "description": "A fern with finely divided, coral-like fronds, often found in moist, sandy soils."
            },
            {
                "name": "Sticherus flabellatus",
                "common_name": "Umbrella Fern",
                "description": "A fern with radiating fronds that resemble an umbrella, typically found in damp, shaded areas."
            },
            {
                "name": "Gleichenia dicarpa",
                "common_name": "Pouched Coral Fern",
                "description": "A fern with small, rounded fronds, commonly found in wetlands and marshes."
            },
            {
                "name": "Gleichenia alpina",
                "common_name": "Alpine Coral Fern",
                "description": "A hardy fern with delicate, finely divided fronds, often found in alpine regions."
            }
        ]
    }
]
